---
kind: property
id: P:Autodesk.Revit.DB.Architecture.BalusterInfo.BaseOffset
source: html/47cc1084-f493-8ee7-5373-3282a0bc612b.htm
---
# Autodesk.Revit.DB.Architecture.BalusterInfo.BaseOffset Property

The offset from the base reference.

## Syntax (C#)
```csharp
public double BaseOffset { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The given value for baseOffset must be no more than 30000 feet in absolute value.